In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv("adult_with_headers (1).csv")

In [6]:
df.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education_num   32561 non-null  int64
 5   marital_status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital_gain    32561 non-null  int64
 11  capital_loss    32561 non-null  int64
 12  hours_per_week  32561 non-null  int64
 13  native_country  32561 non-null  object
 14  income          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [8]:
df.describe()

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [9]:
df.replace('?', np.nan, inplace=True)
df.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education_num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
hours_per_week    0
native_country    0
income            0
dtype: int64

In [10]:
numb_cols = df.select_dtypes(include=['int64', 'float64']).columns
cato_cols = df.select_dtypes(include=['object']).columns

for col in numb_cols:
    df[col].fillna(df[col].median(), inplace=True)

for col in cato_cols:
    df[col].fillna(df[col].mode()[0], inplace=True)

C:\Users\Admin\AppData\Local\Temp\ipykernel_2960\4251843462.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].median(), inplace=True)
C:\Users\Admin\AppData\Local\Temp\ipykernel_2960\4251843462.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].mode()[0], inplace=True)

In [11]:
from sklearn.preprocessing import StandardScaler, MinMaxScaler

num_features = df[numb_cols]

In [12]:
#Standard Scaling   
std_scaler = StandardScaler()
df_standard_scaled = pd.DataFrame(
    std_scaler.fit_transform(num_features),
    columns=numb_cols
)

In [13]:
#Min-Max Scaling
minmax_scaler = MinMaxScaler()
df_minmax_scaled = pd.DataFrame(
    minmax_scaler.fit_transform(num_features),
    columns=numb_cols
)

In [14]:
df[cato_cols].nunique()

workclass          9
education         16
marital_status     7
occupation        15
relationship       6
race               5
sex                2
native_country    42
income             2
dtype: int64

In [15]:
#One-Hot Encoding to categorical variables with less than 5 categories.
low_cardinality_cols = [col for col in cato_cols if df[col].nunique() <= 5]

df1 = pd.get_dummies(df, columns=low_cardinality_cols, drop_first=True)

In [16]:
#Label Encoding for categorical variables
from sklearn.preprocessing import LabelEncoder

high_cardinality_cols = [col for col in cato_cols if df[col].nunique() > 5]

le = LabelEncoder()
for col in high_cardinality_cols:
    df1[col] = le.fit_transform(df1[col])

In [17]:
df1['education_per_year'] = df1['education_num'] / df1['age']

In [18]:
df1['work_intensity'] = df1['hours_per_week'] * df1['age']

In [19]:
df.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [20]:
df1.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,capital_gain,capital_loss,hours_per_week,native_country,race_ Asian-Pac-Islander,race_ Black,race_ Other,race_ White,sex_ Male,income_ >50K,education_per_year,work_intensity
0,39,7,77516,9,13,4,1,1,2174,0,40,39,False,False,False,True,True,False,0.333333,1560
1,50,6,83311,9,13,2,4,0,0,0,13,39,False,False,False,True,True,False,0.260000,650
2,38,4,215646,11,9,0,6,1,0,0,40,39,False,False,False,True,True,False,0.236842,1520
3,53,4,234721,1,7,2,6,0,0,0,40,39,False,True,False,False,True,False,0.132075,2120
4,28,4,338409,9,13,2,10,5,0,0,40,5,False,True,False,False,False,False,0.464286,1120

In [25]:
# Checking skewness
df['capital_gain'].skew()
print('Skew:',df['capital_gain'].skew())
if df['capital_gain'].skew() >= 1 :
 print("Right skewed")
else:
    print ("Left skewed")

Skew: 11.953847687699799
Right skewed

In [26]:
# Applying log transformation
df1['log_capital_gain'] = np.log1p(df['capital_gain'])

In [27]:
df1.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,capital_gain,capital_loss,...,native_country,race_ Asian-Pac-Islander,race_ Black,race_ Other,race_ White,sex_ Male,income_ >50K,education_per_year,work_intensity,log_capital_gain
0,39,7,77516,9,13,4,1,1,2174,0,...,39,False,False,False,True,True,False,0.333333,1560,7.684784
1,50,6,83311,9,13,2,4,0,0,0,...,39,False,False,False,True,True,False,0.260000,650,0.000000
2,38,4,215646,11,9,0,6,1,0,0,...,39,False,False,False,True,True,False,0.236842,1520,0.000000
3,53,4,234721,1,7,2,6,0,0,0,...,39,False,True,False,False,True,False,0.132075,2120,0.000000
4,28,4,338409,9,13,2,10,5,0,0,...,5,False,True,False,False,False,False,0.464286,1120,0.000000

In [27]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 21 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       32561 non-null  int64
 1   workclass                 32561 non-null  int64
 2   fnlwgt                    32561 non-null  int64
 3   education                 32561 non-null  int64
 4   education_num             32561 non-null  int64
 5   marital_status            32561 non-null  int64
 6   occupation                32561 non-null  int64
 7   relationship              32561 non-null  int64
 8   capital_gain              32561 non-null  int64
 9   capital_loss              32561 non-null  int64
 10  hours_per_week            32561 non-null  int64
 11  native_country            32561 non-null  int64
 12  race_ Asian-Pac-Islander  32561 non-null  bool
 13  race_ Black               32561 non-null  bool
 14  race_ Other               32561 non-null  bool
 15  race_ White               32561 non-null  bool
 16  sex_ Male                 32561 non-null  bool
 17  income_ >50K              32561 non-null  bool
 18  education_per_year        32561 non-null  float64
 19  work_intensity            32561 non-null  int64
 20  log_capital_gain          32561 non-null  float64
dtypes: bool(6), float64(2), int64(13)
memory usage: 3.9 MB

In [28]:
df1.describe()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,capital_gain,capital_loss,hours_per_week,native_country,education_per_year,work_intensity,log_capital_gain
count,32561.000000,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000,32561.000000,32561.000000,32561.000000,32561.000000,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,3.868892,1.897784e+05,10.298210,10.080679,2.611836,6.572740,1.446362,1077.648844,87.303830,40.437456,36.718866,0.294056,1571.723411,0.734621
std,13.640433,1.455960,1.055500e+05,3.870264,2.572720,1.506222,4.228857,1.606771,7385.292085,402.960219,12.347429,7.823782,0.118543,740.732449,2.454738
min,17.000000,0.000000,1.228500e+04,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.013333,21.000000,0.000000
25%,28.000000,4.000000,1.178270e+05,9.000000,9.000000,2.000000,3.000000,0.000000,0.000000,0.000000,40.000000,39.000000,0.205882,1050.000000,0.000000
50%,37.000000,4.000000,1.783560e+05,11.000000,10.000000,2.000000,7.000000,1.000000,0.000000,0.000000,40.000000,39.000000,0.281250,1520.000000,0.000000
75%,48.000000,4.000000,2.370510e+05,12.000000,12.000000,4.000000,10.000000,3.000000,0.000000,0.000000,45.000000,39.000000,0.375000,2016.000000,0.000000
max,90.000000,8.000000,1.484705e+06,15.000000,16.000000,6.000000,14.000000,5.000000,99999.000000,4356.000000,99.000000,41.000000,0.777778,8910.000000,11.512925